settings.org


* Package Settings
#+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
#+END_SRC
** Variables for Modes
#+Begin_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(toggle-frame-maximized)
(setq inhibit-splash-screen t)
(setq make-backup-files nil)
(global-linum-mode 1)
(defalias 'yes-or-no-p 'y-or-n-p)
(display-time-mode 1)
(display-battery-mode 1)
(setq column-number-mode t)
(global-hl-line-mode 1)
#+END_SRC
** IDO
*** Description
Interactive DO (File Finder)
*** Code
#+Begin_SRC emacs-lisp
(ido-mode 1)
(setq ido-everywhere t)
(setq ido-enable-flex-matching t)
(setq ido-use-filename-at-point 'guess)
(setq ido-create-new-buffer 'always)
(setq ido-file-extension-order '(".org" ".txt" ".csv"))
#+END_SRC
* Installed Packages
** ido describe binding
#+Begin_SRC emacs-lisp

#+END_SRC
** ido grid mode
#+Begin_SRC emacs-lisp
(ido-grid-mode 1)
#+END_SRC
** Auto-complete
#+Begin_SRC emacs-lisp
(ac-config-default)
#+END_SRC
